#2. Для списка реализовать обмен значений соседних элементов, т.е.
# Значениями обмениваются элементы с индексами 0 и 1, 2 и 3 и т.д.
# При нечетном количестве элементов последний сохранить на своем месте.
# Для заполнения списка элементов необходимо использовать функцию input().

#0 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20


my_list = input("Введи данные: ")

for i in range enumerate(my_list):
my_list[n-1], my_list[n] = my_list[n], my_list[n-1]

print("Кажется получилось: "+ str(my_list))

i = 0
print(f'оз')
while i=1< len(a)
    if i%2 ++0
        a.insert(i, a.pop(i+1)))
    i+=1
print(f'оз {a}')

